saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LPC1100_DFP</name>
  <description>NXP LPC1100 Series Device Support</description>

  <releases>
    <release version="1.4.0" date="2015-10-21">
      Updated SVD file for LPC11Cxx.svd fixing CANTEST->RX register
    </release>
    <release version="1.3.0" date="2015-01-29">
      Added LPC1124 and LPC1125 device support.
      Added board support and examples for:
      - LPCXpresso11U68, LPC11C14 and LPCXpresso1125
      Renamed LPC112x devices according datasheet.
      Reworked Startup section and corrected processor settings.
    </release>
    <release version="1.2.0" date="2014-09-16">
      SVD files updated to version 0.8
    </release>
    <release version="1.1.0" date="2014-07-29">
      Added LPC11E6x device support.
    </release>
    <release version="1.0.0">
      First Release version of LPC1100 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>LPC1100</keyword>
  </keywords>

  <devices>
    <family Dfamily="LPC1100 Series" Dvendor="NXP:11">
      <book name="Documents\dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
      <book name="Documents\dui0662a_cortex_m0p_r0p0_dgug.pdf"      title="Cortex-M0+ Generic User Guide"/>
        <description>
The LPC1100 series is designed for low cost 8/16-bit microcontroller applications, offering performance, low power, simple
instruction set and memory addressing together with reduced code size compared to existing 8/16-bit architectures.
Typical applications include 8-/16-bit applications, eMetering, Lighting, Alarm systems, Consumer peripherals, Mobile devices and White goods.

  - Three reduced power modes: Sleep, Deep-sleep, and Deep power-down.
  - Unique device serial number for identification.
  - Extended temperature (-40 C to +105 C)
        </description>

      <!-- ************************  Subfamily 'LPC1100LV'  **************************** -->
      <subFamily DsubFamily="LPC1100LV">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <processor Dclock="50000000"/>
        <debug svd="SVD\LPC11xxLV_LPC111x_LV.svd"/>
        <book name="Documents\UM10578.pdf"                  title="LPC11xxLV User Manual"/>
        <book name="Documents\LPC111XLV_LPC11XXLVUK.pdf"    title="LPC111XLV/LPC11XXLVUK Datasheet"/>

        <feature type="UART"          n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="ADC"           n="6"       m="8"/>
        <feature type="IOs"           n="21"/>
        <feature type="CSP"           n="25"/>
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- *************************  Device 'LPC1101LVUK'  ***************************** -->
        <device Dname="LPC1101LVUK">
          <compile header="Device\Include\LPC11xxLV\LPC11xxLV.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>
        </device>

        <!-- *************************  Device 'LPC1102LVUK'  ***************************** -->
        <device Dname="LPC1102LVUK">
          <compile header="Device\Include\LPC11xxLV\LPC11xxLV.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        </device>

        <!-- *************************  Device 'LPC1112LVFHI33/103'  ***************************** -->
        <device Dname="LPC1112LVFHI33/103">
          <compile header="Device\Include\LPC11xxLV\LPC11xxLV.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="ADC"           n="8"       m="8"/>
          <feature type="IOs"           n="27"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1112LVFHN24/003'  ***************************** -->
        <device Dname="LPC1112LVFHN24/003">
          <compile header="Device\Include\LPC11xxLV\LPC11xxLV.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>

          <feature type="ADC"           n="6"       m="8"/>
          <feature type="IOs"           n="20"/>
          <feature type="QFN"           n="24"/>
        </device>

        <!-- *************************  Device 'LPC1114LVFHI33/303'  ***************************** -->
        <device Dname="LPC1114LVFHI33/303">
          <compile header="Device\Include\LPC11xxLV\LPC11xxLV.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="ADC"           n="8"       m="8"/>
          <feature type="IOs"           n="27"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1114LVFHN24/103'  ***************************** -->
        <device Dname="LPC1114LVFHN24/103">
          <compile header="Device\Include\LPC11xxLV\LPC11xxLV.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="ADC"           n="6"       m="8"/>
          <feature type="IOs"           n="20"/>
          <feature type="QFN"           n="24"/>
        </device>

        <!-- *************************  Device 'LPC1114LVFHN24/303'  ***************************** -->
        <device Dname="LPC1114LVFHN24/303">
          <compile header="Device\Include\LPC11xxLV\LPC11xxLV.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="ADC"           n="6"       m="8"/>
          <feature type="IOs"           n="20"/>
          <feature type="QFN"           n="24"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC1100XL'  **************************** -->
      <subFamily DsubFamily="LPC1100XL">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <processor Dclock="50000000"/>
        <feature type="UART"          n="1"/>
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- *************************  Device 'LPC1102UK'  ***************************** -->
        <device Dname="LPC1102UK">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC1102_04.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10429.pdf"      title="LPC1102/04 User manual"/>
          <book name="Documents\LPC1102_1104.pdf" title="LPC1102/04 Datasheet"/>

          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="5"       m="8"/>
          <feature type="CSP"           n="16"/>
          <feature type="IOs"           n="11"/>
        </device>

