saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
        <!-- *************************  Device 'LPC1104UK'  ***************************** -->
        <device Dname="LPC1104UK">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC1102_04.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10429.pdf"      title="LPC1102/04 User manual"/>
          <book name="Documents\LPC1102_1104.pdf" title="LPC1102/04 Datasheet"/>

          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="5"       m="8"/>
          <feature type="CSP"           n="16"/>
          <feature type="IOs"           n="13"/>
        </device>

        <!-- *************************  Device 'LPC1110FD20'  ***************************** -->
        <device Dname="LPC1110FD20">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x1000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0400"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_4.FLM"      start="0x00000000"  size="0x1000"  RAMstart="0x10000000"  RAMsize="0x03E0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="5"       m="10"/>
          <feature type="IOs"           n="16"/>
          <feature type="SOP"           n="20"/>
        </device>

        <!-- *************************  Device 'LPC1111FDH20/002'  ***************************** -->
        <device Dname="LPC1111FDH20/002">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="5"       m="10"/>
          <feature type="IOs"           n="16"/>
          <feature type="SOP"           n="20"/>
        </device>

        <!-- *************************  Device 'LPC1111FHN33/101'  ***************************** -->
        <device Dname="LPC1111FHN33/101">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1111FHN33/102'  ***************************** -->
        <device Dname="LPC1111FHN33/102">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1111FHN33/201'  ***************************** -->
        <device Dname="LPC1111FHN33/201">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

