saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1111FHN33/202'  ***************************** -->
        <device Dname="LPC1111FHN33/202">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

		<!-- *************************  Device 'LPC1111FHN33/103'  ***************************** -->
        <device Dname="LPC1111FHN33/103">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1111FHN33/203'  ***************************** -->
        <device Dname="LPC1111FHN33/203">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1112FD20/102 '  ***************************** -->
        <device Dname="LPC1112FD20/102">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="5"       m="10"/>
          <feature type="IOs"           n="16"/>
          <feature type="SOP"           n="20"/>
        </device>

        <!-- *************************  Device 'LPC1112FDH20/102'  ***************************** -->
        <device Dname="LPC1112FDH20/102">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="5"       m="10"/>
          <feature type="IOs"           n="14"/>
          <feature type="SOP"           n="20"/>
        </device>

        <!-- *************************  Device 'LPC1112FDH28/102'  ***************************** -->
        <device Dname="LPC1112FDH28/102">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

