saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="IOs"           n="22"/>
          <feature type="SOP"           n="28"/>
        </device>

        <!-- *************************  Device 'LPC1112FHI33/202'  ***************************** -->
        <device Dname="LPC1112FHI33/202">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1112FHI33/203'  ***************************** -->
        <device Dname="LPC1112FHI33/203">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1112FHN24/202'  ***************************** -->
        <device Dname="LPC1112FHN24/202">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="IOs"           n="19"/>
          <feature type="QFN"           n="24"/>
        </device>

        <!-- *************************  Device 'LPC1112FHN33/101'  ***************************** -->
        <device Dname="LPC1112FHN33/101">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1112FHN33/201'  ***************************** -->
        <device Dname="LPC1112FHN33/201">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1112FHN33/102'  ***************************** -->
        <device Dname="LPC1112FHN33/102">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x07E0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

