saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFN"           n="33"/>
        </device>

        <!-- *************************  Device 'LPC1115FBD48/303'  ***************************** -->
        <device Dname="LPC1115FBD48/303">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1115FET48/303'  ***************************** -->
        <device Dname="LPC1115FET48/303">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="42"/>
          <feature type="BGA"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1115JBD48/303'  ***************************** -->
        <device Dname="LPC1115JBD48/303">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'LPC1115JET48/303'  ***************************** -->
        <device Dname="LPC1115JET48/303">
          <compile header="Device\Include\LPC11xx\LPC11xx.h"/>
          <debug svd="SVD\LPC111x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10398.pdf" title="LPC111x/LPC11Cxx User Manual"/>
          <book name="Documents\LPC111X.pdf" title="LPC1110/11/12/13/14/15 Datasheet"/>

          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="42"/>
          <feature type="BGA"           n="48"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC11A00'  **************************** -->
      <subFamily DsubFamily="LPC11A00">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <processor Dclock="50000000"/>
        <debug svd="SVD\LPC11Axx.svd"/>
        <book name="Documents\UM10527.pdf"  title="LPC11Axx User Manual"/>
        <book name="Documents\LPC11AXX.pdf" title="LPC11Axx Datasheet"/>

        <feature type="UART"          n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="ADC"           n="8"       m="10"/>
        <feature type="DAC"           n="1"       m="10"/>
        <feature type="AnalogOther"   n="1"/>
        <feature type="TempSens"      n="1"/>
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- *************************  Device 'LPC11A02UK'  ***************************** -->
        <device Dname="LPC11A02UK">
          <compile header="Device\Include\LPC11Axx\LPC11Axx.h"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>

          <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
          <feature type="SPI"           n="1"/>
          <feature type="IOs"           n="18"/>
          <feature type="CSP"           n="20"/>
        </device>

