saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
      <!-- ************************  Subfamily 'LPC11U00'  **************************** -->
      <subFamily DsubFamily="LPC11U00">
        <processor Dclock="50000000"/>

        <feature type="Temp"          n="-40"     m="85"/>
        <!-- <feature type="USBD"          n="1"/> -->

        <!-- *************************  Device 'LPC11U12FBD48/201'  ***************************** -->
        <device Dname="LPC11U12FBD48/201">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U1X.pdf" title="LPC11U1x Datasheet"/>

          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U12FHN33/201'  ***************************** -->
        <device Dname="LPC11U12FHN33/201">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U1X.pdf" title="LPC11U1x Datasheet"/>

          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U13FBD48/201'  ***************************** -->
        <device Dname="LPC11U13FBD48/201">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x6000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_24.FLM"     start="0x00000000"  size="0x6000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U1X.pdf" title="LPC11U1x Datasheet"/>

          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U14FBD48/201'  ***************************** -->
        <device Dname="LPC11U14FBD48/201">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U1X.pdf" title="LPC11U1x Datasheet"/>

          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U14FET48/201'  ***************************** -->
        <device Dname="LPC11U14FET48/201">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U1X.pdf" title="LPC11U1x Datasheet"/>

          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="BGA"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U14FHI33/201'  ***************************** -->
        <device Dname="LPC11U14FHI33/201">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U1X.pdf" title="LPC11U1x Datasheet"/>

          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U14FHN33/201'  ***************************** -->
        <device Dname="LPC11U14FHN33/201">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U1X.pdf" title="LPC11U1x Datasheet"/>

          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U23FBD48/301'  ***************************** -->
        <device Dname="LPC11U23FBD48/301">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x6000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1800"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_24.FLM"     start="0x00000000"  size="0x6000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U2X.pdf" title="LPC11U2x Datasheet"/>

