saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
        <!-- *************************  Device 'LPC11U24FHI33/301'  ***************************** -->
        <device Dname="LPC11U24FHI33/301">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x1800"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U2X.pdf" title="LPC11U2x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
          <feature type="USBD"          n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U24FHN33/401'  ***************************** -->
        <device Dname="LPC11U24FHN33/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U2X.pdf" title="LPC11U2x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USBD"          n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U34FBD48/311'  ***************************** -->
        <device Dname="LPC11U34FBD48/311">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xA000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_40.FLM"     start="0x00000000"  size="0xA000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U34FBD48/421'  ***************************** -->
        <device Dname="LPC11U34FBD48/421">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_48.FLM"     start="0x00000000"  size="0xC000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U34FHN33/311'  ***************************** -->
        <device Dname="LPC11U34FHN33/311">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xA000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_40.FLM"     start="0x00000000"  size="0xA000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U34FHN33/421'  ***************************** -->
        <device Dname="LPC11U34FHN33/421">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0xC000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_48.FLM"     start="0x00000000"  size="0xC000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U35FBD48/401'  ***************************** -->
        <device Dname="LPC11U35FBD48/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U35FBD64/401'  ***************************** -->
        <device Dname="LPC11U35FBD64/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U35FET48/501'  ***************************** -->
        <device Dname="LPC11U35FET48/501">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="BGA"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U35FHI33/501'  ***************************** -->
        <device Dname="LPC11U35FHI33/501">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

