saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
        <!-- *************************  Device 'LPC11U35FHN33/401'  ***************************** -->
        <device Dname="LPC11U35FHN33/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="26"/>
          <feature type="QFN"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U36FBD48/401'  ***************************** -->
        <device Dname="LPC11U36FBD48/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x18000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_96.FLM"     start="0x00000000"  size="0x18000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U36FBD64/401'  ***************************** -->
        <device Dname="LPC11U36FBD64/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x18000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_96.FLM"     start="0x00000000"  size="0x18000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U37FBD48/401'  ***************************** -->
        <device Dname="LPC11U37FBD48/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="40"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U37FBD64/501'  ***************************** -->
        <device Dname="LPC11U37FBD64/501">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U37HFBD64/401'  ***************************** -->
        <device Dname="LPC11U37HFBD64/401">
          <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11Uxx.h"/>
          <debug svd="SVD\LPC11Uxx.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20004000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10462.pdf"  title="LPC11U3x/2x/1x User Manual"/>
          <book name="Documents\LPC11U3X.pdf" title="LPC11U3x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"/>
          <feature type="Temp"          n="-40"     m="85"/>
        </device>

        <!-- *************************  Device 'LPC11U66JBD48'  ***************************** -->
        <device Dname="LPC11U66JBD48">
          <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11U6x.h"/>
          <debug svd="SVD\LPC11U6x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10732.pdf"  title="LPC11U6x/E6x User Manual"/>
          <book name="Documents\LPC11U6X.pdf" title="LPC11U6x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="USBD"          n="1"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

