saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.LPC1100_DFP.1.4.0.pdsc
        <!-- *************************  Device 'LPC11U68JBD48'  ***************************** -->
        <device Dname="LPC11U68JBD48">
          <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11U6x.h"/>
          <debug svd="SVD\LPC11U6x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_96_160.FLM" start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10732.pdf"  title="LPC11U6x/E6x User Manual"/>
          <book name="Documents\LPC11U6X.pdf" title="LPC11U6x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="USBD"          n="1"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="48"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>

        <!-- *************************  Device 'LPC11U68JBD64'  ***************************** -->
        <device Dname="LPC11U68JBD64">
          <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
          <compile header="Device\Include\LPC11Uxx\LPC11U6x.h"/>
          <debug svd="SVD\LPC11U6x.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
          <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_96_160.FLM" start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <book name="Documents\UM10732.pdf"  title="LPC11U6x/E6x User Manual"/>
          <book name="Documents\LPC11U6X.pdf" title="LPC11U6x Datasheet"/>

          <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
          <feature type="USART"         n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="MPSerial"      n="2"/>
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="USBD"          n="1"/>
          <feature type="IOs"           n="48"/>
          <feature type="QFP"           n="64"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC1120'  **************************** -->
      <subFamily DsubFamily="LPC1120">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <processor Dclock="50000000"/>
        <debug svd="SVD\LPC112x.svd"/>
          <!--book       name="Documents\NotAvailable.pdf"          title="LPC1120 Reference Manual"/-->

        <feature type="UART"          n="3"/>
        <feature type="SPI"           n="2"/>
        <feature type="I2C"           n="1"/>
        <feature type="ADC"           n="8"       m="12"/>

        <!-- *************************  Device 'LPC1124JBD48/303'  ***************************** -->
        <device Dname="LPC1124JBD48/303">
          <compile header="Device\Include\LPC112x\LPC112x.h"  define="LPC1124"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x08000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x08000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <!--book       name="Documents\NotAvailable.pdf"          title="LPC1125 Series Datasheet"/-->

          <feature type="IOs"           n="38"/>
        </device>

        <!-- *************************  Device 'LPC1125JBD48/303'  ***************************** -->
        <device Dname="LPC1125JBD48/303">
          <compile header="Device\Include\LPC112x\LPC112x.h"  define="LPC1125"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
          <!--book       name="Documents\NotAvailable.pdf"          title="LPC1125 Series Datasheet"/-->

          <feature type="IOs"           n="38"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->

    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="LPC11xx_Cxx">
      <description>NXP LPC1100 Series devices</description>
      <accept Dvendor="NXP:11" Dname="LPC110*"/>
      <accept Dvendor="NXP:11" Dname="LPC111*"/>
      <accept Dvendor="NXP:11" Dname="LPC11C*"/>
      <accept Dvendor="NXP:11" Dname="LPC11D*"/>
      <deny   Dvendor="NXP:11" Dname="LPC11??LV*"/>
    </condition>

